---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.Vendor
source: html/b365e2da-19c4-2002-541b-6944c6f40e5d.htm
---
# Autodesk.Revit.DB.FabricationPart.Vendor Property

The vendor of the fabrication part.

## Syntax (C#)
```csharp
public string Vendor { get; }
```